#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.amazon_ami: Reading...
aws_vpc.this: Refreshing state... [id=vpc-0c5148142fdf5598f]
data.aws_ami.amazon_ami: Read complete after 0s [id=ami-07251f912d2a831a3]
aws_subnet.private[2]: Refreshing state... [id=subnet-0cf73ea83c38f0ce8]
aws_subnet.private[0]: Refreshing state... [id=subnet-0de4c9efb71397d6a]
aws_security_group.http-sg: Refreshing state... [id=sg-0fc26741c5f08809f]
aws_internet_gateway.this-igw: Refreshing state... [id=igw-026e0b0e1a05557b2]
aws_route_table.this-rt: Refreshing state... [id=rtb-0b522699f1fcf4ee5]
aws_subnet.private[1]: Refreshing state... [id=subnet-06744f7a2cd4765cb]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0cedc94706fae8c0b]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08d9b6a8c29d44098]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00c89107347e6896e]
aws_route.internet-route: Refreshing state... [id=r-rtb-0b522699f1fcf4ee51080289494]
aws_instance.app-server[0]: Refreshing state... [id=i-0eefccea6efb485c9]
aws_instance.app-server[1]: Refreshing state... [id=i-06ebad2e23981d2d7]
aws_instance.app-server[2]: Refreshing state... [id=i-0f4e71cdec4ffb6cc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.app-server[0] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-0eefccea6efb485c9"
        tags                                 = {
            "Name" = "app-server-1"
        }
      ~ user_data                            = "f8c969d3cfc2ce542bf59b5c0eaf7a583743503c" -> "9ea6f797c2878361f94d9f508aad35b4b4039b50"
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_instance.app-server[1] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-06ebad2e23981d2d7"
        tags                                 = {
            "Name" = "app-server-2"
        }
      ~ user_data                            = "f8c969d3cfc2ce542bf59b5c0eaf7a583743503c" -> "9ea6f797c2878361f94d9f508aad35b4b4039b50"
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_instance.app-server[2] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-0f4e71cdec4ffb6cc"
        tags                                 = {
            "Name" = "app-server-3"
        }
      ~ user_data                            = "f8c969d3cfc2ce542bf59b5c0eaf7a583743503c" -> "9ea6f797c2878361f94d9f508aad35b4b4039b50"
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_lb.front will be created
  + resource "aws_lb" "front" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "front"
      + security_groups            = [
          + "sg-0fc26741c5f08809f",
        ]
      + subnets                    = [
          + "subnet-06744f7a2cd4765cb",
          + "subnet-0cf73ea83c38f0ce8",
          + "subnet-0de4c9efb71397d6a",
        ]
      + tags                       = {
          + "Environment" = "front"
        }
      + tags_all                   = {
          + "Environment" = "front"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.front_end will be created
  + resource "aws_lb_listener" "front_end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.front will be created
  + resource "aws_lb_target_group" "front" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "application-front"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0c5148142fdf5598f"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group_attachment.attach-app1[0] will be created
  + resource "aws_lb_target_group_attachment" "attach-app1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-0eefccea6efb485c9"
    }

  # aws_lb_target_group_attachment.attach-app1[1] will be created
  + resource "aws_lb_target_group_attachment" "attach-app1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-06ebad2e23981d2d7"
    }

  # aws_lb_target_group_attachment.attach-app1[2] will be created
  + resource "aws_lb_target_group_attachment" "attach-app1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-0f4e71cdec4ffb6cc"
    }

Plan: 6 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + load_balancer_dns_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*